run/cases/pelletExtruder/MRF_PIMPLE/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{  
    
    inlet
    {
        type                flowRateInletVelocity;
        massFlowRate        3e-05;// kg/s
        extrapolateProfile  yes;
        rho                 rho;
        rhoInlet            1040;
        value               uniform (0 0 0);   
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    barrelup
    {
        type            slip;
    }
    wall-component-fluido_en_interior2_layerup
    {
        type            slip;
    }
      
    "barreldown.*"
    {
        type            noSlip;
    }
    wall-component-fluido_en_interior3_layerdown
    {
        type            noSlip;
    }
    
    "screwup.*"
    {
        type            slip;
    }
    
    "screwdown.*"
    {
         type            noSlip;
    }

}


// ************************************************************************* //
