run/cases/pelletExtruder/MRF_PIMPLE/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{    
       
    inlet
    {
        type            zeroGradient;  
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    
    barrelup
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    wall-component-fluido_en_interior2_layerup
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
      
    "barreldown.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    wall-component-fluido_en_interior3_layerdown
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    "screwup.*"
    {
        type            fixedFluxPressure;
        value           uniform 0; 
    }
    
    "screwdown.*"
    {
        type            fixedFluxPressure;
        value           uniform 0; 
    }

}


// ************************************************************************* //
